"""
web应用机制和术语：
术语          解释
URL/URI      统一资源定位符/统一资源标识符，网络资源的唯一标识
域名          与web服务器地址对应的一个易于记忆的字符串名字
DNS          域名解析服务，可以将域名转换成对应的IP地址
IP地址        网络上主机的身份标识，通过IP地址可以区分不同的主机
HTTP         超文本传输协议，构建在TCP之上的应用级协议，万维网数据通信的基础
反向代理       代理客户端向服务器发出请求，然后将服务器返回的资源返回给客户端
web服务器      接受HTTp请求，然后返回HTML文件、纯文本文件、图像等资源给请求者
Nginx         高性能的web服务器，也可以用作反向代理、负载均衡和HTTP缓存
"""
'''
创建一个HelloDjango的Django项目，创建完成后，其文件和文件夹如下所示：
manage.py：一个让你可以管理Django项目的工具程序
HelloDjango/__init__.py：一个空文件，告诉Python解释器这个目录应
'''