"""
python运算符

运算符             描述
[] [:]            下标、切片
**                指数
` + -             按位取反，正负号
* / % //          乘、除、模、整除
+ -               加、减
>> <<             右移、左移
&                 按位与
^ \|              按位异或、按位或
<= < > >=         小于等于、小于、大于、大于等于
== !=             等于、不等于
is is not         身份运算符
in not in         成员运算符
not or and        逻辑运算符
= += -= *= /= %= //= **= &= |= ^= >>= <<=           (复合)赋值运算符

上面所列是按照运算符的优先级从上到下，实际开发中如果不清楚运算符的优先级，可以使用圆括号来确保运算的执行顺序
"""

# ========================= 算术运算符 =========================
# python中的算术运算符除了加减乘除外还有整除运算符、求模(求余数)运算符和求幂运算符
print(321 + 123)  # 加法运算
print(321 - 123)  # 减法运算
print(321 * 123)  # 乘法运算
print(321 / 123)  # 除法运算
print(321 % 123)  # 求模运算
print(321 // 123)  # 整除运算
print(321 ** 123)  # 求幂运算

# ======================== 赋值运算符 ==========================
# 赋值运算符是最为常见的运算符，它的作用是将右边的值赋给左边的变量
'''
赋值运算符和复合赋值运算符
'''
a = 10
b = 3
a += b  # 相当于：a=a+b
a *= a + 2  # 相当于：a=a*(a+2)
print(a)  # a += b的值为a=13,a *= a+2的值为13*(13+2)=195
